app/Cells/ArtikelTerkini.php

    public function render($kategori = null): string
    {
        // Load the model
        $model = new ArtikelModel();

        // Handle category filtering
        if (is_array($kategori) && !empty($kategori)) {
            $model->whereIn('kategori', $kategori);
        } elseif ($kategori) {
            $model->where('kategori', $kategori);
        }

        // Get the latest 5 articles
        $artikel = $model->orderBy('created_at', 'DESC')->limit(5)->findAll();
---
SELECT *
FROM `artikel`
ORDER BY `created_at` DESC
 LIMIT 5