app/Controllers/Artikel.php

    public function index()
    {
        $artikelModel = new ArtikelModel();
        $kategoriModel = new KategoriModel();

        // Ambil slug kategori dari query string
        $kategori_slug = $this->request->getGet('kategori');

        // Ambil semua kategori untuk dropdown
        $kategoriList = $kategoriModel->findAll();

        // Siapkan query builder
        $builder = $artikelModel
            ->select('artikel.*, kategori.nama_kategori, kategori.slug_kategori')
            ->join('kategori', 'kategori.id_kategori = artikel.id_kategori');

        // Jika kategori dipilih, filter berdasarkan slug
        if (!empty($kategori_slug)) {
            $builder->where('kategori.slug_kategori', $kategori_slug);
        }

        // Eksekusi query
        $artikel = $builder->findAll();

        // Ubah judul jika kategori dipilih
        $title = 'Daftar Artikel';
        if (!empty($kategori_slug)) {
            $kategori = $kategoriModel->where('slug_kategori', $kategori_slug)->first();
---
SELECT *
FROM `kategori`
SELECT `artikel`.*, `kategori`.`nama_kategori`, `kategori`.`slug_kategori`
FROM `artikel`
JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
WHERE `kategori`.`slug_kategori` = 'gaya-hidup'
SELECT *
FROM `kategori`
WHERE `slug_kategori` = 'gaya-hidup'
 LIMIT 1

        if ($this->request->isAJAX()) {
            return $this->response->setJSON($data);
        } else {
            $data['kategori'] = $kategoriModel->findAll();
---
SELECT *
FROM `kategori`